// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
function minThreeNumbers (a, b, c)
{
    if (a < b &&  a < c) {
    console.log(a);
    document.write(`найменше число ${a}`);

    } else if (b < a &&  b < c) {
    console.log(b);
    document.write(`найменше число ${b}`);

    } else if  (c < a &&  c < b) {
     console.log(c);
     document.write(`найменше число ${c}`);

    } else {
     console.log('error');
     document.write('error')
     }
}
minThreeNumbers (
    prompt(`Шукаємо найменше число, ведіть число а`),
    prompt(`ведіть число б`),
    prompt(`ведіть число с`)
);

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
function maxThreeNumbers (a, b, c)
{
    if (a > b &&  a > c) {
        console.log(a);
        document.write(`найбільше число ${a}`);

    } else if (b > a &&  b > c) {
        console.log(b);
        document.write(`найбільше число ${b}`);

    } else if  (c > a &&  c > b) {
        console.log(c);
        document.write(`найбільше число ${c}`);

    } else {
        console.log('error');
        document.write('error')
    }
}
maxThreeNumbers (
    prompt(`Шукаємо найбільше число, ведіть число а`),
    prompt(`ведіть число б`),
    prompt(`ведіть число с`)
);


// - створити функцію яка повертає найбільше число з масиву

let arreyMax = [1,5,10,15,20,25,30];






// - створити функцію яка повертає найменьше число з масиву




// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його.
// Приклад [1,2,10]->13




// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].