// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let num1 = 2;
let num2 = 2;

if (num1 > num2) {
    console.log(`Найбільше число ${num1}`)
} else if (num1<num2) {
    console.log(`Найбільше число ${num2}`)
} else if (num1===num2) {
    console.log('числа рівні')
} else {
    console.log('помилка ведення даних')
}

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let numHome = prompt('Ведіть  номер квартири')

if (numHome >=1 && numHome <= 20) {
    console.log(`Ви ввели ${numHome} Квартира знаходиться в першому підїзді`);
} else if (numHome >=21 && numHome <= 48) {
    console.log(`Ви ввели ${numHome} Квартира знаходиться в другому підїзді`);
} else if (numHome >=49 && numHome <= 90) {
    console.log(`Ви ввели ${numHome} Квартира знаходиться в третьому підїзді`);
} else {
    console.log(`Ви ввели ${numHome} Немає такої квартири в нашому будинку`)
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = 213;

if (number %10 === 0 ){
    console.log('ВІРНО')
} else {
    console.log('НЕВІРНО')
}

//  - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//  Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//  Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let studyToday = 22;

if (studyToday >= 10 && studyToday <= 22){
    console.log('ми йдемо ВЧИТИСЯ')
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}

//  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//  числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let numberS = '1';

switch (numberS) {
    case '1':
        console.log('авто');
    break;
    case '2':
        console.log('мото');
        break;
    case '3':
        console.log('телефон');
        break;
    case '4':
        console.log('книга');
        break;
    case '5':
        console.log('по зубам');
        break;

        default:
            console.log('помилка вводу даних');
}