// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
function minNumber (a,b,c)
{
    if (a < b && b < c){
    document.write(`найменше число ${a}<br>`)
    } else if (b < a  && b < c){
    document.write(`найменше число ${b}<br>`)
    } else if (c < a && c < b){
    document.write(`найменше число ${c}<br>`)
    } else {
    document.write(`помилка вводу данних<br>`)
    }
}
minNumber ( 10 ,20 ,5)

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
function maxNumber (a,b,c){
    if (a > b && b > c){
    document.write(`найбільше число ${a}<br>`)
    } else if (b > a && b > c ){
    document.write(`найбільше число ${b}<br>`)
    } else if (c > a && c > b ) {
    document.write(`найбільше число ${c}<br>`)
    } else {
    document.write(`помилка вводу данних<br>`)
    }
}
maxNumber (1, 23, 66)

// - створити функцію яка повертає найбільше число з масиву

let arreyTest = [10,50,100]


 function maxNumberPRO (arrey){

    let max = arrey[0];

     for (const arreyElement of arrey) {
         if (arreyElement > arrey) {
             max = arreyElement;
         }
     return max;
     }
     }

console.log(maxNumberPRO (arreyTest));






// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].